RSA967/Los-Grises-WRO-2026-MX/src/ESP32_Open_Giro_90.ino
// ------------------- GIRO EXPERIMENTAL DE 90 GRADOS -----------------
// S2 es el sensor izquierdo a 25 grados y S4 el derecho. El modo se arma
// cuando uno de ellos ve la pared central y comienza el giro cuando ese mismo
// sensor supera 150 cm y S3 confirma que el robot llego a una esquina.
constexpr bool GIRO_90_HABILITADO = true;
constexpr uint16_t PARED_PRESENTE_PARA_ARMAR_GIRO_MM = 800;
constexpr uint16_t SENSOR_LIBRE_PARA_INICIAR_GIRO_MM = 1250;
constexpr uint16_t DISTANCIA_FRONTAL_MAXIMA_PARA_GIRO_MM = 800;
constexpr uint8_t MUESTRAS_LIBRES_PARA_CONFIRMAR_GIRO = 3;
constexpr float ANGULO_OBJETIVO_GIRO_GRADOS = 90.0f;
constexpr float TOLERANCIA_GIRO_GRADOS = 2.0f;
constexpr int CORRECCION_SERVO_DURANTE_GIRO_GRADOS = 35;
constexpr int DIRECCION_FISICA_SERVO_GIRO = -1;
constexpr uint8_t VELOCIDAD_DURANTE_GIRO_PORCENTAJE = 55;
constexpr unsigned long DURACION_RECTA_DESPUES_GIRO_MS = 300;
constexpr unsigned long DURACION_MAXIMA_GIRO_90_MS = 2500;

// En este BNO085 el recorrido antihorario observado acumula grados negativos.
// S2 libre inicia un giro antihorario (-1); S4 libre, uno horario (+1).
constexpr int DIRECCION_GIRO_CON_S2 = -1;
constexpr int DIRECCION_GIRO_CON_S4 = 1;

// Pulsos habituales para un SG90. Como el movimiento queda limitado a
// 55..135 grados, el servo trabaja lejos de sus topes electricos.
constexpr uint16_t SERVO_PULSO_MINIMO_US = 500;
constexpr uint16_t SERVO_PULSO_MAXIMO_US = 2500;

// ====================================================================
//                    FIN DE VARIABLES DE CALIBRACION
// ====================================================================

// ------------------------ Configuracion general ----------------------

constexpr uint8_t NANO_I2C_ADDRESS = 0x08;
constexpr uint8_t SENSOR_COUNT = 5;
constexpr uint8_t DISTANCE_PACKET_BYTES = SENSOR_COUNT * 2;
constexpr uint16_t INVALID_DISTANCE_MM = 0xFFFF;
constexpr uint16_t DISTANCIA_SIN_ECO_MM = 2000;

// Pines I2C de la DFRobot FireBeetle ESP32 DFR0478.
// En la placa estan rotulados como SDA/IO21 y SCL/IO22.
constexpr uint8_t ESP32_SDA_PIN = 21;
constexpr uint8_t ESP32_SCL_PIN = 22;
constexpr uint32_t I2C_FREQUENCY_HZ = 100000;

// El ESP32 consulta a 50 Hz para usar cada lectura nueva del Nano con poca
// latencia. La impresion se limita para que Serial no frene el control.
constexpr unsigned long SENSOR_POLL_INTERVAL_MS = 20;
constexpr unsigned long SERIAL_PRINT_INTERVAL_MS = 500;

constexpr uint32_t SERVO_PWM_FREQUENCY_HZ = 50;
constexpr uint8_t SERVO_PWM_RESOLUTION_BITS = 16;

// PWM inaudible para el motor DC. Diez bits dan un rango de 0 a 1023.
constexpr uint32_t MOTOR_PWM_FREQUENCY_HZ = 20000;
constexpr uint8_t MOTOR_PWM_RESOLUTION_BITS = 10;

// Si se pierde la comunicacion con los sensores, el motor se detiene.
constexpr unsigned long SENSOR_FAILSAFE_TIMEOUT_MS = 250;

#if ESP_ARDUINO_VERSION_MAJOR < 3
constexpr uint8_t SERVO_PWM_CHANNEL = 0;
constexpr uint8_t MOTOR_PWM_CHANNEL = 1;
#endif

static_assert(DIRECCION_SERVO == 1 || DIRECCION_SERVO == -1,
              "DIRECCION_SERVO debe ser 1 o -1");
static_assert(DISTANCIA_FRENTE_INICIO_MM > DISTANCIA_FRENTE_CRITICA_MM,
              "La distancia de inicio debe ser mayor que la critica");
static_assert(DISTANCIA_FRENTE_SALIDA_RETROCESO_MM >
                  DISTANCIA_FRENTE_RETROCESO_MM,
              "La salida del retroceso debe superar su distancia de entrada");
static_assert(DURACION_FRENO_ANTES_RETROCESO_MS > 0,
              "La duracion del freno debe ser mayor que cero");
static_assert(DURACION_MAXIMA_RETROCESO_MS > 0,
              "La duracion maxima de retroceso debe ser mayor que cero");
static_assert(VELOCIDAD_MOTOR_PORCENTAJE >=
                  VELOCIDAD_MOTOR_EN_ESQUINA_PORCENTAJE,
              "La velocidad normal debe ser mayor o igual que la minima");
static_assert(VELOCIDAD_MOTOR_PORCENTAJE >=
                  VELOCIDAD_MINIMA_PARED_LATERAL_PORCENTAJE,
              "La velocidad lateral minima no puede superar la normal");
static_assert(PARED_LATERAL_CERCA_INICIO_MM >
                  PARED_LATERAL_CERCA_MAXIMA_MM,
              "El rango de cercania lateral debe ser descendente");
static_assert(DIFERENCIA_LATERAL_MAXIMA_MM >
                  DIFERENCIA_LATERAL_INICIO_MM,
              "El rango de diferencia lateral debe ser ascendente");
static_assert(VELOCIDAD_DETECCION_ARRANQUE_PORCENTAJE > 0,
              "La velocidad de deteccion debe ser mayor que cero");
static_assert(VELOCIDAD_DETECCION_ARRANQUE_PORCENTAJE <=
                  VELOCIDAD_MOTOR_EN_ESQUINA_PORCENTAJE,
              "La velocidad de deteccion no debe superar la minima");
static_assert(VELOCIDAD_RETROCESO_ESCAPE_PORCENTAJE > 0 &&
                  VELOCIDAD_RETROCESO_ESCAPE_PORCENTAJE <= 100,
              "La velocidad de retroceso debe estar entre 1 y 100");
static_assert(PULSOS_ENCODER_PARA_ARRANCAR > 0,
              "Se necesita al menos un pulso para detectar movimiento");
static_assert(DURACION_AVANCE_FINAL_MS > 0,
              "El avance final debe durar mas de cero");
static_assert(VELOCIDAD_AJUSTE_FINAL_PORCENTAJE > 0 &&
                  VELOCIDAD_AJUSTE_FINAL_PORCENTAJE <= 100,
              "La velocidad de ajuste final debe estar entre 1 y 100");
static_assert(DISTANCIA_SALIDA_AJUSTE_FINAL_MM >
                  DISTANCIA_INICIO_AJUSTE_FINAL_MM,
              "La salida del ajuste final debe superar su inicio");
static_assert(DURACION_FRENO_AJUSTE_FINAL_MS > 0 &&
                  DURACION_MAXIMA_AJUSTE_FINAL_MS > 0,
              "Los tiempos del ajuste final deben ser mayores que cero");
static_assert(DIRECCION_SERVO_AJUSTE_FINAL == 1 ||
                  DIRECCION_SERVO_AJUSTE_FINAL == -1,
              "La direccion del servo de ajuste debe ser 1 o -1");
static_assert(KP >= 0.0f && KI >= 0.0f && KD >= 0.0f,
              "KP, KI y KD no pueden ser negativos");
static_assert(MULTIPLICADOR_KP_INICIAL > 0.0f &&
                  MULTIPLICADOR_KP_INICIAL <= 1.0f,
              "El multiplicador de Kp inicial debe estar entre 0 y 1");
static_assert(BRILLO_LED_EN_ESQUINA_PORCENTAJE <= 100,
              "El brillo LED de esquina no puede superar 100");
static_assert(SENSOR_LIBRE_PARA_INICIAR_GIRO_MM >
                  PARED_PRESENTE_PARA_ARMAR_GIRO_MM,
              "El umbral libre debe superar al de pared presente");
static_assert(MUESTRAS_LIBRES_PARA_CONFIRMAR_GIRO > 0,
              "El giro necesita al menos una muestra libre");
static_assert(DIRECCION_GIRO_CON_S2 == -1 &&
                  DIRECCION_GIRO_CON_S4 == 1,
              "Las direcciones de giro deben ser -1 para S2 y 1 para S4");
static_assert(DIRECCION_FISICA_SERVO_GIRO == 1 ||
                  DIRECCION_FISICA_SERVO_GIRO == -1,
              "La direccion fisica del servo debe ser 1 o -1");
static_assert(FILTRO_DERIVADA >= 0.0f && FILTRO_DERIVADA <= 1.0f,
              "FILTRO_DERIVADA debe estar entre 0 y 1");

bool servoPwmReady = false;
bool motorPwmReady = false;
uint8_t velocidadObjetivoPorcentaje = 0;
uint8_t velocidadAplicadaPorcentaje = 0;
uint8_t brilloLedBasePorcentaje = 0;
bool ledsIndicandoEsquina = false;
bool retrocesoEscapeActivo = false;
bool retrocesoEscapeFrenando = false;
bool retrocesoEscapeLimiteAlcanzado = false;
unsigned long retrocesoEscapeStartMs = 0;
bool distanceSensorFailsafeActive = false;
int currentServoAngle = SERVO_CENTRO_GRADOS;
float latestCornerFactor = 0.0f;
float latestLateralWallFactor = 0.0f;
uint16_t latestDistancesMm[SENSOR_COUNT] = {
    INVALID_DISTANCE_MM,
    INVALID_DISTANCE_MM,
    INVALID_DISTANCE_MM,
    INVALID_DISTANCE_MM,
    INVALID_DISTANCE_MM
};

