RSA967/Los-Grises-WRO-2026-MX/src/ESP32_Open_Giro_90.ino
volatile uint32_t encoderPulseCount = 0;

Adafruit_BNO08x bno085(-1);
sh2_SensorValue_t bno085SensorValue;
bool bno085Initialized = false;
bool bno085HasHeading = false;
bool bno085FailsafeActive = false;
uint8_t bno085I2cAddressDetected = 0;
bool lapTrackingActive = false;
bool missionComplete = false;
bool finalAdvanceActive = false;
unsigned long finalAdvanceAccumulatedMs = 0;
unsigned long finalAdvanceLastUpdateMs = 0;
bool finalReverseActive = false;
bool finalReverseBraking = false;
unsigned long finalReverseStateStartMs = 0;
unsigned long finalReverseStartMs = 0;
float finalReverseTargetTurnDegrees = 0.0f;
bool roundTimerStarted = false;
unsigned long roundStartMs = 0;
unsigned long roundFinishMs = 0;
float currentYawDegrees = 0.0f;
float previousYawDegrees = 0.0f;
float accumulatedTurnDegrees = 0.0f;
uint8_t completedLaps = 0;
unsigned long lastBno085FrameMs = 0;

WebServer dashboardServer(80);

enum class MotorStartupState : uint8_t {
  WAITING_FOR_MOVEMENT,
  RAMPING,
  RUNNING
};

enum class GyroCornerState : uint8_t {
  IDLE,
  TURNING,
  STRAIGHTENING,
  FAILED
};

MotorStartupState motorStartupState =
    MotorStartupState::WAITING_FOR_MOVEMENT;
GyroCornerState gyroCornerState = GyroCornerState::IDLE;
bool gyroCornerLeftArmed = false;
bool gyroCornerRightArmed = false;
uint8_t gyroCornerFreeSamples = 0;
int gyroCornerPendingDirection = 0;
int gyroCornerCourseDirection = 0;
int gyroCornerTurnDirection = 0;
float gyroCornerTargetTurnDegrees = 0.0f;
unsigned long gyroCornerTurnStartMs = 0;
unsigned long gyroCornerStraightStartMs = 0;
uint32_t encoderDetectionBaseline = 0;
unsigned long encoderDetectionWindowStartMs = 0;
unsigned long motorRampStartMs = 0;
bool encoderDetectionWindowActive = false;

float pidIntegralError = 0.0f;
float pidPreviousError = 0.0f;
float pidFilteredDerivative = 0.0f;
unsigned long pidPreviousUpdateUs = 0;
bool pidHasPreviousSample = false;

struct ControlState {
  float leftValue;
  float rightValue;
  float error;
  float startupKpFactor;
  float effectiveKp;
  float pTerm;
  float iTerm;
  float dTerm;
  float cornerFactor;
  float lateralWallFactor;
  int servoAngle;
  uint8_t speedPercent;
};

void resetPidControl() {
  pidIntegralError = 0.0f;
  pidPreviousError = 0.0f;
  pidFilteredDerivative = 0.0f;
  pidPreviousUpdateUs = 0;
  pidHasPreviousSample = false;
}

// --------------------------- Dashboard WiFi ------------------------

const char DASHBOARD_HTML[] PROGMEM = R"rawliteral(
<!doctype html>
<html lang="es">
<head>
  <meta charset="utf-8">
  <meta name="viewport" content="width=device-width,initial-scale=1">
  <title>WRO Open - Telemetria</title>
  <style>
    :root{color-scheme:dark;--bg:#071018;--card:#101d28;--line:#263846;
      --text:#eef6fa;--muted:#91a6b4;--cyan:#35d6ff;--green:#45e68a;
      --orange:#ffb454;--red:#ff6474}
    *{box-sizing:border-box} body{margin:0;background:radial-gradient(circle at
      top,#123046 0,var(--bg) 45%);color:var(--text);font:15px system-ui,
      sans-serif;min-height:100vh}.wrap{width:min(1040px,94vw);margin:auto;
      padding:24px 0 40px}header{display:flex;justify-content:space-between;
      gap:16px;align-items:center;margin-bottom:18px}h1{font-size:clamp(22px,5vw,
      36px);margin:0;letter-spacing:-.04em}.tag{color:var(--cyan);font-weight:800;
      letter-spacing:.12em;font-size:12px}.status{padding:9px 13px;border:1px solid
      var(--line);border-radius:999px;background:#0c1720;color:var(--muted);
      white-space:nowrap}.status.ok{color:var(--green);border-color:#246b49}
      .status.warn{color:var(--orange);border-color:#745124}.status.stop{
      color:var(--red);border-color:#7a303a}.grid{display:grid;
      grid-template-columns:repeat(4,1fr);gap:12px}.card{background:linear-gradient(
      145deg,#132430,#0d1821);border:1px solid var(--line);border-radius:16px;
      padding:16px;box-shadow:0 12px 35px #0004}.wide{grid-column:span 2}
      .label{color:var(--muted);font-size:12px;text-transform:uppercase;
      letter-spacing:.09em}.value{font-size:clamp(26px,5vw,42px);font-weight:800;
      margin-top:4px}.unit{font-size:14px;color:var(--muted);font-weight:500}
      .laps{color:var(--cyan)}.sensors{display:grid;grid-template-columns:
      repeat(5,1fr);gap:9px;margin-top:12px}.sensor{text-align:center;background:#09131b;
      border-radius:12px;padding:12px 5px}.sensor b{display:block;font-size:20px;
      margin-top:4px}.bar{height:5px;background:#24333d;border-radius:9px;
      overflow:hidden;margin-top:9px}.bar i{display:block;height:100%;width:0;
      background:var(--cyan);transition:width .2s}.details{display:grid;
      grid-template-columns:repeat(4,1fr);gap:8px;margin-top:12px}.detail{
      background:#09131b;border-radius:10px;padding:10px}.detail b{display:block;
      margin-top:4px;font-size:18px}footer{color:var(--muted);text-align:center;
      margin-top:18px;font-size:12px}@media(max-width:720px){.grid{
      grid-template-columns:repeat(2,1fr)}.wide{grid-column:span 2}.details{
      grid-template-columns:repeat(2,1fr)}header{align-items:flex-start;
      flex-direction:column}}@media(max-width:420px){.sensors{gap:4px}.sensor{
      padding:10px 2px}.sensor b{font-size:16px}}
  </style>
</head>
<body><main class="wrap">
  <header><div><div class="tag">WRO INDIA 2026</div><h1>Robot Open</h1></div>
    <div id="status" class="status">Conectando...</div></header>
  <section class="grid">
    <article class="card"><div class="label">Vueltas</div>
      <div class="value laps"><span id="laps">--</span><span class="unit"> / <span id="goal">3</span></span></div></article>
    <article class="card"><div class="label">Rumbo</div>
      <div class="value"><span id="yaw">--</span><span class="unit">&deg;</span></div></article>
    <article class="card"><div class="label">Giro acumulado</div>
      <div class="value"><span id="turn">--</span><span class="unit">&deg;</span></div></article>
    <article class="card"><div class="label">Tiempo de ronda</div>
      <div class="value"><span id="roundTime">0:00.0</span></div></article>
    <article class="card wide"><div class="label">Distancias</div>
      <div class="sensors" id="sensors"></div></article>
    <article class="card wide"><div class="label">Control</div>
      <div class="details">
        <div class="detail">Motor<b><span id="speed">--</span>/<span id="target">--</span>%</b></div>
        <div class="detail">Servo<b><span id="servo">--</span>&deg;</b></div>
        <div class="detail">Error PID<b id="error">--</b></div>
        <div class="detail">Proteccion lateral<b><span id="lateralRisk">--</span>%</b></div>
        <div class="detail">Encoder<b id="encoder">--</b></div>
      </div></article>
  </section>
  <footer>Actualizacion local cada 250 ms &middot; 192.168.4.1</footer>
</main>
<script>
  const sensors=document.getElementById('sensors');
  sensors.innerHTML=[1,2,3,4,5].map(n=>`<div class="sensor"><span class="label">S${n}</span><b id="s${n}">--</b><div class="bar"><i id="b${n}"></i></div></div>`).join('');
  const put=(id,v)=>document.getElementById(id).textContent=v;
  async function refresh(){
    try{
      const r=await fetch('/api/status',{cache:'no-store'}),d=await r.json();
      put('laps',d.laps);put('goal',d.goal);put('yaw',d.yaw.toFixed(1));
      put('turn',d.turn.toFixed(1));put('speed',d.speed);put('target',d.target);
      const totalSeconds=d.elapsedMs/1000,minutes=Math.floor(totalSeconds/60);
      put('roundTime',minutes+':'+String(Math.floor(totalSeconds%60)).padStart(2,'0')+'.'+Math.floor((d.elapsedMs%1000)/100));
      put('servo',d.servo);put('error',d.error.toFixed(1));put('encoder',d.encoder);
      put('lateralRisk',Math.round(d.lateralRisk*100));
      d.distances.forEach((v,i)=>{put(`s${i+1}`,v<0?'--':(v/10).toFixed(1)+' cm');
        document.getElementById(`b${i+1}`).style.width=(v<0?0:Math.min(100,v/15))+'%'});
      const st=document.getElementById('status');st.textContent=d.state;
      st.className='status '+d.level;
    }catch(e){const st=document.getElementById('status');st.textContent='Sin conexion';
      st.className='status stop'}
  }
  refresh();setInterval(refresh,250);
</script></body></html>
)rawliteral";

const char *dashboardStateText() {
  if (missionComplete) return "3 vueltas completadas";
  if (finalReverseActive) return "3 vueltas: ajuste final";
  if (finalAdvanceActive) return "3 vueltas: avance final";
  if (gyroCornerState == GyroCornerState::TURNING) {
    return "Giro de esquina por BNO085";
  }
  if (gyroCornerState == GyroCornerState::STRAIGHTENING) {
    return "Salida recta de esquina";
  }
  if (gyroCornerState == GyroCornerState::FAILED) {
    return "Falla en giro de 90 grados";
  }
  if (!bno085Initialized) return "BNO085 I2C no detectado";
  if (!bno085HasHeading) return "BNO085 esperando orientacion";
  if (bno085FailsafeActive) return "Sin datos BNO085";
  if (distanceSensorFailsafeActive) return "Sin sensores de distancia";
  if (retrocesoEscapeActivo) return "Escape en retroceso";
  if (latestLateralWallFactor > 0.0f) return "Reduciendo por pared lateral";
  if (motorStartupState == MotorStartupState::WAITING_FOR_MOVEMENT) {
    return "Esperando movimiento";
  }
  if (motorStartupState == MotorStartupState::RAMPING) return "Rampa suave";
  return "En marcha";
}

const char *dashboardStateLevel() {
  if (missionComplete || distanceSensorFailsafeActive ||
      gyroCornerState == GyroCornerState::FAILED ||
      (EXIGIR_BNO085_PARA_MOVERSE && bno085FailsafeActive)) return "stop";
  if (finalAdvanceActive || finalReverseActive ||
      gyroCornerState != GyroCornerState::IDLE || !bno085HasHeading ||
      retrocesoEscapeActivo ||
      latestLateralWallFactor > 0.0f ||
      bno085FailsafeActive ||
      motorStartupState == MotorStartupState::WAITING_FOR_MOVEMENT) {
    return "warn";
  }
  return "ok";
}

int dashboardDistance(uint8_t index) {
  return latestDistancesMm[index] == INVALID_DISTANCE_MM
             ? -1
             : static_cast<int>(latestDistancesMm[index]);
}

