RSA967/Los-Grises-WRO-2026-MX/src/ESP32_Open_Giro_90.ino
void sendDashboardStatus() {
  char json[700];
  snprintf(
      json,
      sizeof(json),
      "{\"yaw\":%.2f,\"turn\":%.2f,\"laps\":%u,\"goal\":%u,"
      "\"elapsedMs\":%lu,\"speed\":%u,\"target\":%u,"
      "\"servo\":%d,\"error\":%.2f,\"lateralRisk\":%.3f,"
      "\"encoder\":%lu,\"distances\":[%d,%d,%d,%d,%d],"
      "\"bnoI2c\":%u,"
      "\"state\":\"%s\",\"level\":\"%s\"}",
      currentYawDegrees,
      accumulatedTurnDegrees,
      completedLaps,
      VUELTAS_OBJETIVO,
      roundElapsedMs(),
      velocidadAplicadaPorcentaje,
      velocidadObjetivoPorcentaje,
      currentServoAngle,
      pidPreviousError,
      latestLateralWallFactor,
      static_cast<unsigned long>(readEncoderPulseCount()),
      dashboardDistance(0),
      dashboardDistance(1),
      dashboardDistance(2),
      dashboardDistance(3),
      dashboardDistance(4),
      bno085I2cAddressDetected,
      dashboardStateText(),
      dashboardStateLevel()
  );

  dashboardServer.send(200, "application/json", json);
}

void beginDashboard() {
  if (!DASHBOARD_HABILITADO) {
    WiFi.mode(WIFI_OFF);
    Serial.println("Dashboard WiFi deshabilitado para ronda.");
    return;
  }

  WiFi.mode(WIFI_AP);
  WiFi.softAP(DASHBOARD_WIFI_NOMBRE, DASHBOARD_WIFI_CLAVE);
  dashboardServer.on("/", []() {
    dashboardServer.send_P(200, "text/html; charset=utf-8", DASHBOARD_HTML);
  });
  dashboardServer.on("/api/status", sendDashboardStatus);
  dashboardServer.onNotFound([]() {
    dashboardServer.send(404, "text/plain", "No encontrado");
  });
  dashboardServer.begin();

  Serial.print("Dashboard: conecta a ");
  Serial.print(DASHBOARD_WIFI_NOMBRE);
  Serial.print(" y abre http://");
  Serial.println(WiFi.softAPIP());
}

void updateDashboard() {
  if (DASHBOARD_HABILITADO) {
    dashboardServer.handleClient();
  }
}

// ----------------------- Sensor BNO085 / vueltas -------------------

float normalizeHeadingDelta(float deltaDegrees) {
  while (deltaDegrees > 180.0f) {
    deltaDegrees -= 360.0f;
  }

  while (deltaDegrees < -180.0f) {
    deltaDegrees += 360.0f;
  }

  return deltaDegrees;
}

void finishThreeLapMission() {
  if (missionComplete) {
    return;
  }

  finalAdvanceActive = false;
  finalReverseActive = false;
  finalReverseBraking = false;
  finalReverseStateStartMs = 0;
  finalReverseStartMs = 0;
  finalReverseTargetTurnDegrees = 0.0f;
  missionComplete = true;
  completedLaps = VUELTAS_OBJETIVO;
  if (roundTimerStarted) {
    roundFinishMs = millis();
  }
  stopMotor();
  writeServoAngle(SERVO_CENTRO_GRADOS);

  Serial.println();
  Serial.println(
      "*** 3 VUELTAS Y AJUSTE FINAL COMPLETADOS: ROBOT DETENIDO ***"
  );
}

void startFinalAdvance(unsigned long nowMs) {
  if (missionComplete || finalAdvanceActive || finalReverseActive) {
    return;
  }

  completedLaps = VUELTAS_OBJETIVO;
  finalAdvanceActive = true;
  finalAdvanceAccumulatedMs = 0;
  finalAdvanceLastUpdateMs = nowMs;

  Serial.println();
  Serial.print("*** 3 VUELTAS: AVANCE FINAL DURANTE ");
  Serial.print(DURACION_AVANCE_FINAL_MS);
  Serial.println(" ms EFECTIVOS ***");
}

void startFinalReverseIfNeeded(unsigned long nowMs) {
  const uint16_t frontDistanceMm = latestDistancesMm[2];
  const bool needsReverse =
      frontDistanceMm != INVALID_DISTANCE_MM &&
      frontDistanceMm < DISTANCIA_INICIO_AJUSTE_FINAL_MM;

  finalAdvanceActive = false;

  if (!needsReverse) {
    finishThreeLapMission();
    return;
  }

  stopMotor();
  writeServoAngle(SERVO_CENTRO_GRADOS);
  finalReverseActive = true;
  finalReverseBraking = true;
  finalReverseStateStartMs = nowMs;
  finalReverseStartMs = nowMs;
  finalReverseTargetTurnDegrees =
      accumulatedTurnDegrees < 0.0f
          ? -(GRADOS_POR_VUELTA * VUELTAS_OBJETIVO)
          : GRADOS_POR_VUELTA * VUELTAS_OBJETIVO;

  Serial.print("Ajuste final: pared frontal a ");
  Serial.print(frontDistanceMm / 10);
  Serial.print(" cm; retrocedera hasta ");
  Serial.print(DISTANCIA_SALIDA_AJUSTE_FINAL_MM / 10);
  Serial.println(" cm.");
}

void updateFinalReverse(unsigned long nowMs) {
  if (!finalReverseActive || missionComplete) {
    return;
  }

  const uint16_t frontDistanceMm = latestDistancesMm[2];
  const bool reachedTargetDistance =
      frontDistanceMm != INVALID_DISTANCE_MM &&
      frontDistanceMm >= DISTANCIA_SALIDA_AJUSTE_FINAL_MM;

  if (reachedTargetDistance) {
    Serial.print("Ajuste final terminado: S3 alcanzo ");
    Serial.print(frontDistanceMm / 10);
    Serial.println(" cm.");
    finishThreeLapMission();
    return;
  }

  if (nowMs - finalReverseStartMs >= DURACION_MAXIMA_AJUSTE_FINAL_MS) {
    Serial.println(
        "Ajuste final detenido por alcanzar el limite de seguridad."
    );
    finishThreeLapMission();
    return;
  }

  const float headingErrorDegrees =
      accumulatedTurnDegrees - finalReverseTargetTurnDegrees;
  const float steeringCorrectionDegrees = constrain(
      static_cast<float>(DIRECCION_SERVO_AJUSTE_FINAL) *
          KP_RUMBO_AJUSTE_FINAL * headingErrorDegrees,
      -static_cast<float>(CORRECCION_MAXIMA_AJUSTE_FINAL_GRADOS),
      static_cast<float>(CORRECCION_MAXIMA_AJUSTE_FINAL_GRADOS)
  );
  const int finalReverseServoAngle = static_cast<int>(roundf(
      SERVO_CENTRO_GRADOS + steeringCorrectionDegrees
  ));

  // A +/-1080 grados el error es cero y el servo queda exactamente en 90.
  writeServoAngle(finalReverseServoAngle);

  if (finalReverseBraking) {
    if (nowMs - finalReverseStateStartMs >=
        DURACION_FRENO_AJUSTE_FINAL_MS) {
      finalReverseBraking = false;
      finalReverseStateStartMs = nowMs;
      velocidadObjetivoPorcentaje =
          VELOCIDAD_AJUSTE_FINAL_PORCENTAJE;
      setMotorDirectionReverse();
      applyMotorPwmPercent(VELOCIDAD_AJUSTE_FINAL_PORCENTAJE);

      Serial.print("Ajuste final: reversa al ");
      Serial.print(VELOCIDAD_AJUSTE_FINAL_PORCENTAJE);
      Serial.print("%, rumbo objetivo ");
      Serial.print(finalReverseTargetTurnDegrees, 1);
      Serial.println(" grados.");
    }
    return;
  }

  velocidadObjetivoPorcentaje = VELOCIDAD_AJUSTE_FINAL_PORCENTAJE;
  setMotorDirectionReverse();
  applyMotorPwmPercent(VELOCIDAD_AJUSTE_FINAL_PORCENTAJE);

