RSA967/Los-Grises-WRO-2026-MX/src/ESP32_Open_Giro_90.ino
    if (detectedPulses > 0 && !encoderDetectionWindowActive) {
      encoderDetectionWindowActive = true;
      encoderDetectionWindowStartMs = nowMs;
    }

    if (encoderDetectionWindowActive &&
        detectedPulses >= PULSOS_ENCODER_PARA_ARRANCAR) {
      motorStartupState = MotorStartupState::RAMPING;
      motorRampStartMs = nowMs;

      if (!roundTimerStarted) {
        roundTimerStarted = true;
        roundStartMs = nowMs;
        roundFinishMs = 0;
        Serial.println("Cronometro de ronda iniciado.");
      }

      Serial.println(
          "Movimiento de motor detectado: inicia rampa suave."
      );
      return;
    }

    if (encoderDetectionWindowActive &&
        nowMs - encoderDetectionWindowStartMs >=
            VENTANA_DETECCION_MOVIMIENTO_MS) {
      // Pulsos aislados no deben armar el arranque. Se abre una ventana nueva.
      encoderDetectionBaseline = currentPulseCount;
      encoderDetectionWindowActive = false;
    }

    return;
  }

  if (motorStartupState == MotorStartupState::RAMPING) {
    const unsigned long elapsedMs = nowMs - motorRampStartMs;

    if (elapsedMs >= DURACION_ARRANQUE_SUAVE_MS) {
      motorStartupState = MotorStartupState::RUNNING;
      applyMotorPwmPercent(velocidadObjetivoPorcentaje);
      Serial.println("Rampa suave terminada.");
      return;
    }

    const int16_t speedRange =
        static_cast<int16_t>(velocidadObjetivoPorcentaje) -
        static_cast<int16_t>(
            VELOCIDAD_DETECCION_ARRANQUE_PORCENTAJE
        );
    const int16_t rampSpeed =
        static_cast<int16_t>(
            VELOCIDAD_DETECCION_ARRANQUE_PORCENTAJE
        ) +
        static_cast<int32_t>(speedRange) * elapsedMs /
            DURACION_ARRANQUE_SUAVE_MS;

    applyMotorPwmPercent(static_cast<uint8_t>(rampSpeed));
    return;
  }

  applyMotorPwmPercent(velocidadObjetivoPorcentaje);
}

bool updateReverseEscape(
    uint16_t frontDistanceMm,
    unsigned long nowMs
) {
  const bool validFrontDistance =
      frontDistanceMm != INVALID_DISTANCE_MM;

  if (!retrocesoEscapeActivo && validFrontDistance &&
      frontDistanceMm <= DISTANCIA_FRENTE_RETROCESO_MM) {
    // Corta el PWM antes de invertir el puente H.
    writeMotorPwmPercent(0);
    velocidadAplicadaPorcentaje = 0;
    digitalWrite(MOTOR_AIN1_PIN, LOW);
    digitalWrite(MOTOR_AIN2_PIN, LOW);

    retrocesoEscapeActivo = true;
    retrocesoEscapeFrenando = true;
    retrocesoEscapeLimiteAlcanzado = false;
    retrocesoEscapeStartMs = nowMs;
    velocidadObjetivoPorcentaje = 0;
    resetPidControl();

    writeServoAngle(SERVO_CENTRO_GRADOS);

    Serial.print("Obstaculo a menos de ");
    Serial.print(DISTANCIA_FRENTE_RETROCESO_MM / 10);
    Serial.println(" cm: inicia frenado antes del retroceso.");
  }

  const bool frontClear =
      validFrontDistance &&
      frontDistanceMm >= DISTANCIA_FRENTE_SALIDA_RETROCESO_MM;
  const bool reverseTimeout =
      retrocesoEscapeActivo && !frontClear &&
      !retrocesoEscapeFrenando &&
      !retrocesoEscapeLimiteAlcanzado &&
      nowMs - retrocesoEscapeStartMs >= DURACION_MAXIMA_RETROCESO_MS;

  if (retrocesoEscapeActivo && frontClear) {
    // Detiene el motor antes de recuperar el sentido hacia adelante.
    writeMotorPwmPercent(0);
    velocidadAplicadaPorcentaje = 0;
    velocidadObjetivoPorcentaje = 0;
    retrocesoEscapeActivo = false;
    retrocesoEscapeFrenando = false;
    retrocesoEscapeLimiteAlcanzado = false;
    retrocesoEscapeStartMs = 0;

    setMotorDirectionForward();
    resetMotorStartupDetection();
    resetPidControl();

    Serial.println(
        "Espacio frontal liberado: termina el retroceso de escape."
    );
  }

  if (retrocesoEscapeActivo && retrocesoEscapeFrenando &&
      nowMs - retrocesoEscapeStartMs >=
          DURACION_FRENO_ANTES_RETROCESO_MS) {
    retrocesoEscapeFrenando = false;
    retrocesoEscapeStartMs = nowMs;
    velocidadObjetivoPorcentaje =
        VELOCIDAD_RETROCESO_ESCAPE_PORCENTAJE;

    setMotorDirectionReverse();
    applyMotorPwmPercent(VELOCIDAD_RETROCESO_ESCAPE_PORCENTAJE);

    Serial.print("Inicia retroceso al ");
    Serial.print(VELOCIDAD_RETROCESO_ESCAPE_PORCENTAJE);
    Serial.println("%.");
  }

  if (reverseTimeout) {
    writeMotorPwmPercent(0);
    velocidadAplicadaPorcentaje = 0;
    velocidadObjetivoPorcentaje = 0;
    retrocesoEscapeLimiteAlcanzado = true;

    Serial.println(
        "Tiempo maximo de retroceso alcanzado: motor detenido."
    );
  }

  if (retrocesoEscapeActivo) {
    writeServoAngle(SERVO_CENTRO_GRADOS);

    if (!retrocesoEscapeFrenando &&
        !retrocesoEscapeLimiteAlcanzado) {
      setMotorDirectionReverse();
      applyMotorPwmPercent(VELOCIDAD_RETROCESO_ESCAPE_PORCENTAJE);
    }
  }

  return retrocesoEscapeActivo;
}

void resetGyroCornerDetection() {
  gyroCornerState = GyroCornerState::IDLE;
  gyroCornerLeftArmed = false;
  gyroCornerRightArmed = false;
  gyroCornerFreeSamples = 0;
  gyroCornerPendingDirection = 0;
  gyroCornerTurnDirection = 0;
  gyroCornerTargetTurnDegrees = 0.0f;
  gyroCornerTurnStartMs = 0;
  gyroCornerStraightStartMs = 0;
}

void startGyroCornerTurn(int turnDirection, unsigned long nowMs) {
  gyroCornerState = GyroCornerState::TURNING;
  gyroCornerTurnDirection = turnDirection;
  gyroCornerCourseDirection = turnDirection;
  gyroCornerTargetTurnDegrees =
      accumulatedTurnDegrees +
      static_cast<float>(turnDirection) * ANGULO_OBJETIVO_GIRO_GRADOS;
  gyroCornerTurnStartMs = nowMs;
  gyroCornerFreeSamples = 0;
  gyroCornerPendingDirection = 0;
  resetPidControl();

  Serial.print("Giro BNO085 iniciado: ");
  Serial.print(turnDirection == DIRECCION_GIRO_CON_S2 ? "S2" : "S4");
  Serial.print(" libre, objetivo acumulado ");
  Serial.print(gyroCornerTargetTurnDegrees, 1);
  Serial.println(" grados.");
}

bool updateGyroCornerControl(
    const uint16_t distancesMm[SENSOR_COUNT],
    unsigned long nowMs
) {
  if (!GIRO_90_HABILITADO || missionComplete || finalAdvanceActive ||
      finalReverseActive) {
    return false;
  }

  if (gyroCornerState == GyroCornerState::FAILED) {
    stopMotor();
    writeServoAngle(SERVO_CENTRO_GRADOS);
    return true;
  }

  if (!bno085HasHeading || bno085FailsafeActive) {
    if (gyroCornerState != GyroCornerState::IDLE) {
      gyroCornerState = GyroCornerState::FAILED;
      stopMotor();
      writeServoAngle(SERVO_CENTRO_GRADOS);
      Serial.println("GIRO 90 detenido: no hay rumbo valido del BNO085.");
      return true;
    }
    return false;
  }

  if (gyroCornerState == GyroCornerState::TURNING) {
    const float remainingDegrees =
        static_cast<float>(gyroCornerTurnDirection) *
        (gyroCornerTargetTurnDegrees - accumulatedTurnDegrees);

    if (remainingDegrees <= TOLERANCIA_GIRO_GRADOS) {
      gyroCornerState = GyroCornerState::STRAIGHTENING;
      gyroCornerStraightStartMs = nowMs;
      writeServoAngle(SERVO_CENTRO_GRADOS);
      setMotorSpeedPercent(VELOCIDAD_DURANTE_GIRO_PORCENTAJE);
      resetPidControl();

      Serial.print("Giro de 90 grados completo en ");
      Serial.print(accumulatedTurnDegrees, 1);
      Serial.println(" grados; servo centrado.");
      return true;
    }

    if (nowMs - gyroCornerTurnStartMs >= DURACION_MAXIMA_GIRO_90_MS) {
      gyroCornerState = GyroCornerState::FAILED;
      stopMotor();
      writeServoAngle(SERVO_CENTRO_GRADOS);
      Serial.println(
          "GIRO 90 detenido: no alcanzo el angulo dentro del tiempo limite."
      );
      return true;
    }

    // DIRECCION_FISICA_SERVO_GIRO permite invertir el varillaje sin cambiar
    // el signo de giro que debe alcanzar el BNO085.
    const int servoAngle =
        SERVO_CENTRO_GRADOS -
        DIRECCION_FISICA_SERVO_GIRO * gyroCornerTurnDirection *
            CORRECCION_SERVO_DURANTE_GIRO_GRADOS;
    writeServoAngle(servoAngle);
    setMotorSpeedPercent(VELOCIDAD_DURANTE_GIRO_PORCENTAJE);
    return true;
  }

