RSA967/Los-Grises-WRO-2026-MX/src/ESP32_Open_Giro_90.ino
  if (gyroCornerState == GyroCornerState::STRAIGHTENING) {
    writeServoAngle(SERVO_CENTRO_GRADOS);
    setMotorSpeedPercent(VELOCIDAD_DURANTE_GIRO_PORCENTAJE);

    if (nowMs - gyroCornerStraightStartMs >=
        DURACION_RECTA_DESPUES_GIRO_MS) {
      resetGyroCornerDetection();
      resetPidControl();
      Serial.println("Salida recta terminada: regresa el control PID.");
      return false;
    }
    return true;
  }

  const uint16_t s2 = distancesMm[1];
  const uint16_t s3 = distancesMm[2];
  const uint16_t s4 = distancesMm[3];
  const bool validS2 = s2 != INVALID_DISTANCE_MM;
  const bool validS3 = s3 != INVALID_DISTANCE_MM;
  const bool validS4 = s4 != INVALID_DISTANCE_MM;

  if (gyroCornerCourseDirection <= 0 && validS2 &&
      s2 <= PARED_PRESENTE_PARA_ARMAR_GIRO_MM) {
    gyroCornerLeftArmed = true;
  }
  if (gyroCornerCourseDirection >= 0 && validS4 &&
      s4 <= PARED_PRESENTE_PARA_ARMAR_GIRO_MM) {
    gyroCornerRightArmed = true;
  }

  const bool frontConfirmsCorner =
      validS3 && s3 <= DISTANCIA_FRONTAL_MAXIMA_PARA_GIRO_MM;
  const bool leftTurnCandidate =
      gyroCornerCourseDirection <= 0 && gyroCornerLeftArmed && validS2 &&
      s2 >= SENSOR_LIBRE_PARA_INICIAR_GIRO_MM && frontConfirmsCorner;
  const bool rightTurnCandidate =
      gyroCornerCourseDirection >= 0 && gyroCornerRightArmed && validS4 &&
      s4 >= SENSOR_LIBRE_PARA_INICIAR_GIRO_MM && frontConfirmsCorner;

  int candidateDirection = 0;
  if (leftTurnCandidate) {
    candidateDirection = DIRECCION_GIRO_CON_S2;
  } else if (rightTurnCandidate) {
    candidateDirection = DIRECCION_GIRO_CON_S4;
  }

  if (candidateDirection == 0) {
    gyroCornerFreeSamples = 0;
    gyroCornerPendingDirection = 0;
    return false;
  }

  if (candidateDirection != gyroCornerPendingDirection) {
    gyroCornerPendingDirection = candidateDirection;
    gyroCornerFreeSamples = 1;
  } else if (gyroCornerFreeSamples < MUESTRAS_LIBRES_PARA_CONFIRMAR_GIRO) {
    ++gyroCornerFreeSamples;
  }

  if (gyroCornerFreeSamples >= MUESTRAS_LIBRES_PARA_CONFIRMAR_GIRO) {
    startGyroCornerTurn(candidateDirection, nowMs);
    const int servoAngle =
        SERVO_CENTRO_GRADOS -
        DIRECCION_FISICA_SERVO_GIRO * candidateDirection *
            CORRECCION_SERVO_DURANTE_GIRO_GRADOS;
    writeServoAngle(servoAngle);
    setMotorSpeedPercent(VELOCIDAD_DURANTE_GIRO_PORCENTAJE);
    return true;
  }

  return false;
}

ControlState updatePidControl(
    const uint16_t distancesMm[SENSOR_COUNT],
    unsigned long nowMs
) {
  const float s1 = lateralDistanceForControl(distancesMm[0]);
  const float s2 = lateralDistanceForControl(distancesMm[1]);
  const float s4 = lateralDistanceForControl(distancesMm[3]);
  const float s5 = lateralDistanceForControl(distancesMm[4]);

  ControlState state;
  state.leftValue = s1 * PESO_S1 + s2 * PESO_S2;
  state.rightValue = s4 * PESO_S4 + s5 * PESO_S5;
  state.error = state.leftValue - state.rightValue;

  state.cornerFactor = calculateCornerFactor(distancesMm[2]);
  latestCornerFactor = state.cornerFactor;
  state.lateralWallFactor = calculateLateralWallFactor(s1, s2, s4, s5);
  latestLateralWallFactor = state.lateralWallFactor;
  state.startupKpFactor = calculateStartupKpFactor(nowMs);
  const float wallProximityFactor =
      fmaxf(state.cornerFactor, state.lateralWallFactor);
  state.effectiveKp =
      KP *
      (
          1.0f +
          wallProximityFactor *
              (MULTIPLICADOR_KP_EN_ESQUINA - 1.0f)
      ) *
      state.startupKpFactor;

  const unsigned long nowUs = micros();
  float derivative = 0.0f;

  if (pidHasPreviousSample) {
    const float dtSeconds =
        static_cast<float>(nowUs - pidPreviousUpdateUs) / 1000000.0f;

    if (dtSeconds > 0.0f && dtSeconds <= 0.25f) {
      pidIntegralError += state.error * dtSeconds;

      if (KI > 0.0f) {
        const float integralLimitError = LIMITE_INTEGRAL_GRADOS / KI;
        pidIntegralError = constrain(
            pidIntegralError,
            -integralLimitError,
            integralLimitError
        );
      } else {
        pidIntegralError = 0.0f;
      }

      const float rawDerivative =
          (state.error - pidPreviousError) / dtSeconds;
      pidFilteredDerivative +=
          FILTRO_DERIVADA *
          (rawDerivative - pidFilteredDerivative);
      derivative = pidFilteredDerivative;
    }
  } else {
    pidHasPreviousSample = true;
  }

  pidPreviousError = state.error;
  pidPreviousUpdateUs = nowUs;

  state.pTerm = state.effectiveKp * state.error;
  state.iTerm = constrain(
      KI * pidIntegralError,
      -LIMITE_INTEGRAL_GRADOS,
      LIMITE_INTEGRAL_GRADOS
  );
  state.dTerm = KD * derivative;

  float correctionDegrees =
      static_cast<float>(DIRECCION_SERVO) *
      (state.pTerm + state.iTerm + state.dTerm);

  correctionDegrees = constrain(
      correctionDegrees,
      -static_cast<float>(SERVO_RECORRIDO_MAXIMO_GRADOS),
      static_cast<float>(SERVO_RECORRIDO_MAXIMO_GRADOS)
  );

  state.servoAngle = static_cast<int>(
      roundf(SERVO_CENTRO_GRADOS + correctionDegrees)
  );

  const float cornerSpeed =
      VELOCIDAD_MOTOR_PORCENTAJE -
      state.cornerFactor *
          (VELOCIDAD_MOTOR_PORCENTAJE -
           VELOCIDAD_MOTOR_EN_ESQUINA_PORCENTAJE);
  const float lateralWallSpeed =
      VELOCIDAD_MOTOR_PORCENTAJE -
      state.lateralWallFactor *
          (VELOCIDAD_MOTOR_PORCENTAJE -
           VELOCIDAD_MINIMA_PARED_LATERAL_PORCENTAJE);

  // No suma reducciones: toma la velocidad mas segura de las dos.
  state.speedPercent = static_cast<uint8_t>(
      roundf(fminf(cornerSpeed, lateralWallSpeed))
  );

  writeServoAngle(state.servoAngle);
  setMotorSpeedPercent(state.speedPercent);

  return state;
}

// ------------------------- Comunicacion I2C --------------------------

bool sendBrightnessPercent(uint8_t percent) {
  if (percent > 100) {
    percent = 100;
  }

  Wire.beginTransmission(NANO_I2C_ADDRESS);
  Wire.write(percent);
  const uint8_t error = Wire.endTransmission();

  if (error != 0) {
    Serial.print("Error I2C al enviar intensidad. Codigo: ");
    Serial.println(error);
    return false;
  }

