RSA967/Los-Grises-WRO-2026-MX/src/ESP32_Open_Giro_90.ino
  return true;
}

void updateCornerLedIndicator(float cornerFactor) {
  const bool cornerDetected = cornerFactor > 0.0f;

  if (cornerDetected == ledsIndicandoEsquina) {
    return;
  }

  const uint8_t targetBrightness =
      cornerDetected ? BRILLO_LED_EN_ESQUINA_PORCENTAJE
                     : brilloLedBasePorcentaje;

  if (!sendBrightnessPercent(targetBrightness)) {
    return;
  }

  ledsIndicandoEsquina = cornerDetected;
  Serial.print("Indicador de esquina: LEDs ");
  Serial.print(cornerDetected ? "encendidos al " : "restaurados al ");
  Serial.print(targetBrightness);
  Serial.println("%.");
}

bool readDistancesMm(uint16_t outputMm[SENSOR_COUNT]) {
  const uint8_t received = Wire.requestFrom(
      static_cast<uint8_t>(NANO_I2C_ADDRESS),
      static_cast<uint8_t>(DISTANCE_PACKET_BYTES)
  );

  if (received != DISTANCE_PACKET_BYTES) {
    Serial.print("Respuesta I2C incompleta: ");
    Serial.print(received);
    Serial.print("/");
    Serial.println(DISTANCE_PACKET_BYTES);

    while (Wire.available()) {
      Wire.read();
    }
    return false;
  }

  for (uint8_t i = 0; i < SENSOR_COUNT; ++i) {
    const uint8_t lowByte = Wire.read();
    const uint8_t highByte = Wire.read();
    const uint16_t decodedDistance =
        static_cast<uint16_t>(lowByte) |
        (static_cast<uint16_t>(highByte) << 8);
    outputMm[i] = decodedDistance == INVALID_DISTANCE_MM
                      ? DISTANCIA_SIN_ECO_MM
                      : decodedDistance;
  }

  return true;
}

void printDistances(const uint16_t distancesMm[SENSOR_COUNT]) {
  for (uint8_t i = 0; i < SENSOR_COUNT; ++i) {
    Serial.print("S");
    Serial.print(i + 1);
    Serial.print(": ");

    if (distancesMm[i] == INVALID_DISTANCE_MM) {
      Serial.print("sin eco");
    } else {
      // Imprime centimetros con un decimal, sin usar float.
      Serial.print(distancesMm[i] / 10);
      Serial.print(".");
      Serial.print(distancesMm[i] % 10);
      Serial.print(" cm");
    }

    if (i < SENSOR_COUNT - 1) {
      Serial.print(" | ");
    }
  }

  Serial.println();
}

void printControlState(const ControlState &state) {
  Serial.print("Error: ");
  Serial.print(state.error, 1);
  Serial.print(" | Rampa Kp: ");
  Serial.print(state.startupKpFactor * 100.0f, 0);
  Serial.print("%");
  Serial.print(" | Kp efectivo: ");
  Serial.print(state.effectiveKp, 4);
  Serial.print(" | P: ");
  Serial.print(state.pTerm, 1);
  Serial.print(" I: ");
  Serial.print(state.iTerm, 1);
  Serial.print(" D: ");
  Serial.print(state.dTerm, 1);
  Serial.print(" | Esquina: ");
  Serial.print(state.cornerFactor * 100.0f, 0);
  Serial.print("% | Proteccion lateral: ");
  Serial.print(state.lateralWallFactor * 100.0f, 0);
  Serial.print("% | Servo: ");
  Serial.print(state.servoAngle);
  Serial.print(" grados | Velocidad objetivo: ");
  Serial.print(state.speedPercent);
  Serial.print("% | Velocidad aplicada: ");
  Serial.print(velocidadAplicadaPorcentaje);
  Serial.print("% | Rumbo: ");
  Serial.print(currentYawDegrees, 1);
  Serial.print(" grados | Giro acumulado: ");
  Serial.print(accumulatedTurnDegrees, 1);
  Serial.print(" grados | Vueltas: ");
  Serial.print(completedLaps);
  Serial.print("/");
  Serial.println(VUELTAS_OBJETIVO);
}

// ---------------------- Control desde el monitor ---------------------

// Escribe un numero de 0 a 100 y Enter en el monitor serial.
// En el programa final tambien puedes llamar directamente a:
//   sendBrightnessPercent(valor);
void handleSerialBrightnessCommand() {
  static char input[8];
  static uint8_t length = 0;

  while (Serial.available()) {
    const char character = static_cast<char>(Serial.read());

    if (character == '\r' || character == '\n') {
      if (length == 0) {
        continue;
      }

      input[length] = '\0';
      char *endPointer = nullptr;
      const long value = strtol(input, &endPointer, 10);

      if (*endPointer == '\0' && value >= 0 && value <= 100) {
        brilloLedBasePorcentaje = static_cast<uint8_t>(value);

        if (ledsIndicandoEsquina) {
          Serial.print("Intensidad base guardada: ");
          Serial.print(value);
          Serial.println("%. Se aplicara al salir de la esquina.");
        } else if (sendBrightnessPercent(brilloLedBasePorcentaje)) {
          Serial.print("Intensidad enviada al Nano: ");
          Serial.print(value);
          Serial.println("%");
        }
      } else {
        Serial.println("Valor invalido. Escribe un numero de 0 a 100.");
      }

      length = 0;
      continue;
    }

    if (length < sizeof(input) - 1) {
      input[length++] = character;
    } else {
      // Si la linea es demasiado larga, se descarta.
      length = 0;
      Serial.println("Entrada demasiado larga.");
    }
  }
}

// ----------------------------- Arduino -------------------------------

void setup() {
  Serial.begin(115200);

  beginEncoder();

  Wire.begin(
      ESP32_SDA_PIN,
      ESP32_SCL_PIN,
      I2C_FREQUENCY_HZ
  );
  beginBno085I2c();

  servoPwmReady = beginServoPwm();
  if (servoPwmReady) {
    writeServoAngle(SERVO_CENTRO_GRADOS);
  } else {
    Serial.println("ERROR: no se pudo iniciar el PWM del servo.");
  }

  motorPwmReady = beginMotorPwm();
  if (motorPwmReady) {
    stopMotor();
  } else {
    Serial.println("ERROR: no se pudo iniciar el PWM del motor.");
  }

  delay(10);

  // Estado seguro al arrancar: tira apagada.
  sendBrightnessPercent(brilloLedBasePorcentaje);

  beginDashboard();

  Serial.println();
  Serial.println("ESP32 maestro I2C listo.");
  Serial.print("Servo centrado en ");
  Serial.print(SERVO_CENTRO_GRADOS);
  Serial.println(" grados.");
  Serial.println("Motor detenido; arrancara al recibir sensores por I2C.");
  Serial.print("Encoder: A=D5, B=D9. PWM de espera: ");
  Serial.print(VELOCIDAD_DETECCION_ARRANQUE_PORCENTAJE);
  Serial.println("%.");
  Serial.print("BNO085 I2C en SDA=21/SCL=22. Objetivo: ");
  Serial.print(VUELTAS_OBJETIVO);
  Serial.println(" vueltas.");
  Serial.println("Esperando el primer paquete de rumbo para habilitar motor.");
  Serial.println("Escribe una intensidad de 0 a 100 y presiona Enter.");
}

void loop() {
  handleSerialBrightnessCommand();
  updateDashboard();

  static unsigned long lastPollMs = 0;
  static unsigned long lastValidSensorMs = 0;
  const unsigned long nowMs = millis();

  updateBno085(nowMs);
  updateFinalAdvance(nowMs);
  updateFinalReverse(nowMs);

  if (lapTrackingActive && !missionComplete && bno085HasHeading &&
      nowMs - lastBno085FrameMs >= BNO085_FAILSAFE_TIMEOUT_MS) {
    if (!bno085FailsafeActive) {
      bno085FailsafeActive = true;

