RSA967/Los-Grises-WRO-2026-MX/src/ESP32_Open_Giro_90.ino
      if (finalReverseActive) {
        Serial.println(
            "Ajuste final cancelado: se perdio el rumbo del BNO085."
        );
        finishThreeLapMission();
      } else if (EXIGIR_BNO085_PARA_MOVERSE) {
        stopMotor();
        writeServoAngle(SERVO_CENTRO_GRADOS);
        Serial.println("Motor detenido: sin datos de rumbo del BNO085.");
      } else {
        Serial.println(
            "AVISO: sin BNO085; continua movimiento sin conteo de vueltas."
        );
      }
    }
  }

  if (nowMs - lastPollMs >= SENSOR_POLL_INTERVAL_MS) {
    lastPollMs = nowMs;

    uint16_t distancesMm[SENSOR_COUNT];
    if (readDistancesMm(distancesMm)) {
      lastValidSensorMs = nowMs;
      distanceSensorFailsafeActive = false;

      for (uint8_t i = 0; i < SENSOR_COUNT; ++i) {
        latestDistancesMm[i] = distancesMm[i];
      }

      static unsigned long lastPrintMs = 0;
      const float cornerFactor = calculateCornerFactor(distancesMm[2]);

      // Al completar tres vueltas el paro queda enclavado. El BNO085 solo
      // bloquea el movimiento si EXIGIR_BNO085_PARA_MOVERSE esta activado.
      const bool bno085BlocksMovement =
          EXIGIR_BNO085_PARA_MOVERSE &&
          (!bno085HasHeading || bno085FailsafeActive);

      if (missionComplete || bno085BlocksMovement) {
        if (velocidadObjetivoPorcentaje > 0 ||
            velocidadAplicadaPorcentaje > 0 || retrocesoEscapeActivo) {
          stopMotor();
          writeServoAngle(SERVO_CENTRO_GRADOS);
        }
        return;
      }

      // El ajuste de llegada controla motor y servo desde updateFinalReverse().
      if (finalReverseActive) {
        return;
      }

      const bool reversing = updateReverseEscape(distancesMm[2], nowMs);

      updateCornerLedIndicator(cornerFactor);

      if (reversing) {
        if (gyroCornerState != GyroCornerState::IDLE) {
          resetGyroCornerDetection();
          Serial.println("Giro de 90 cancelado por escape frontal.");
        }

        if (nowMs - lastPrintMs >= SERIAL_PRINT_INTERVAL_MS) {
          lastPrintMs = nowMs;
          printDistances(distancesMm);

          if (retrocesoEscapeFrenando) {
            Serial.println(
                "Escape activo: frenando, servo centrado."
            );
          } else if (retrocesoEscapeLimiteAlcanzado) {
            Serial.println(
                "Escape en espera: motor detenido, servo centrado."
            );
          } else {
            Serial.print("Escape activo: retroceso al ");
            Serial.print(VELOCIDAD_RETROCESO_ESCAPE_PORCENTAJE);
            Serial.println("%, servo centrado.");
          }
        }
      } else if (updateGyroCornerControl(distancesMm, nowMs)) {
        updateMotorSoftStart(nowMs);

        if (nowMs - lastPrintMs >= SERIAL_PRINT_INTERVAL_MS) {
          lastPrintMs = nowMs;
          printDistances(distancesMm);
          Serial.print("Control=GIRO_90_BNO | giro=");
          Serial.print(accumulatedTurnDegrees, 1);
          Serial.print(" | objetivo=");
          Serial.print(gyroCornerTargetTurnDegrees, 1);
          Serial.print(" | servo=");
          Serial.println(currentServoAngle);
        }
      } else {
        const ControlState state =
            updatePidControl(distancesMm, nowMs);

        updateMotorSoftStart(nowMs);

        if (nowMs - lastPrintMs >= SERIAL_PRINT_INTERVAL_MS) {
          lastPrintMs = nowMs;
          printDistances(distancesMm);
          printControlState(state);
        }
      }
    }
  }

  // Mantiene la rampa fluida aun entre dos consultas I2C.
  const bool bno085AllowsMovement =
      !EXIGIR_BNO085_PARA_MOVERSE ||
      (bno085HasHeading && !bno085FailsafeActive);

  if (!missionComplete && !finalReverseActive && bno085AllowsMovement &&
      !retrocesoEscapeActivo) {
    updateMotorSoftStart(nowMs);
  }

  if ((velocidadObjetivoPorcentaje > 0 || retrocesoEscapeActivo) &&
      nowMs - lastValidSensorMs >= SENSOR_FAILSAFE_TIMEOUT_MS) {
    if (finalReverseActive) {
      Serial.println(
          "Ajuste final cancelado: se perdieron los sensores de distancia."
      );
      distanceSensorFailsafeActive = true;
      finishThreeLapMission();
      updateCornerLedIndicator(0.0f);
      return;
    }

    retrocesoEscapeActivo = false;
    retrocesoEscapeLimiteAlcanzado = false;
    stopMotor();
    updateCornerLedIndicator(0.0f);

    if (!distanceSensorFailsafeActive) {
      distanceSensorFailsafeActive = true;
      Serial.println("Motor detenido: sin datos I2C de sensores.");
    }
  }
}
